Glacierty/jlx12864_uc1701x/hello_lcd/Drivers/BSP/STM32ZET6_MILESTONE/stm32zet6_milestone_lcd.c
/******************************************************************************
                            Static Function
*******************************************************************************/
/**
  * @brief  Draws a pixel on LCD.
  * @param  Xpos: X position 
  * @param  Ypos: Y position
  * @param  RGBCode: Pixel color in RGB mode (5-6-5)  
  * @retval None
  */
static void LCD_DrawPixel(uint16_t Xpos, uint16_t Ypos, uint16_t RGBCode)
{
  if(lcd_drv->WritePixel != NULL)
  {
    lcd_drv->WritePixel(Xpos, Ypos, RGBCode);
  }
}

/**
  * @brief  Draws a character on LCD.
  * @param  Xpos: Line where to display the character shape
  * @param  Ypos: Start column address
  * @param  pChar: Pointer to the character data
  * @retval None
  */
static void LCD_DrawChar(uint16_t Xpos, uint16_t Ypos, const uint8_t *pChar)
{
  uint32_t counterh = 0, counterw = 0, index = 0;
  uint16_t height = 0, width = 0;
  uint8_t offset = 0;
  uint8_t *pchar = NULL;
  uint32_t line = 0;
  
 
  height = DrawProp.pFont->Height;
  width  = DrawProp.pFont->Width;
  
  /* Fill bitmap header*/
 // *(uint16_t *) (bitmap + 2) = (uint16_t)(height*width*2+OFFSET_BITMAP);
 // *(uint16_t *) (bitmap + 4) = (uint16_t)((height*width*2+OFFSET_BITMAP)>>16);
  *(uint16_t *) (bitmap + 2) = (uint16_t)(height*width+OFFSET_BITMAP);
  *(uint16_t *) (bitmap + 4) = (uint16_t)((height*width+OFFSET_BITMAP)>>16);
  *(uint16_t *) (bitmap + 10) = OFFSET_BITMAP;
  *(uint16_t *) (bitmap + 18) = (uint16_t)(width);
  *(uint16_t *) (bitmap + 20) = (uint16_t)((width)>>16);
  *(uint16_t *) (bitmap + 22) = (uint16_t)(height);
  *(uint16_t *) (bitmap + 24) = (uint16_t)((height)>>16);

  offset =  8 *((width + 7)/8) -  width ;
  
  for(counterh = 0; counterh < height; counterh++)
  {
    pchar = ((uint8_t *)pChar + (width + 7)/8 * counterh);
    
    if(((width + 7)/8) == 3)
    {
      line =  (pchar[0]<< 16) | (pchar[1]<< 8) | pchar[2];
    }

    if(((width + 7)/8) == 2)
    {
      line =  (pchar[0]<< 8) | pchar[1];
    }
      
    if(((width + 7)/8) == 1)
    {
      line =  pchar[0];
    }  
    
    for (counterw = 0; counterw < width; counterw++)
    {
      /* Image in the bitmap is written from the bottom to the top */
      /* Need to invert image in the bitmap */
      //index = (((height-counterh-1)*width)+(counterw))*2+OFFSET_BITMAP;
      index = (((height-counterh-1)*width)+(counterw))+OFFSET_BITMAP;   
      if(line & (1 << (width- counterw + offset- 1))) 
      {
        bitmap[index] = (uint8_t)DrawProp.TextColor;
        //bitmap[index+1] = (uint8_t)(DrawProp.TextColor >> 8);
      }
      else
      {
        bitmap[index] = (uint8_t)DrawProp.BackColor;
       // bitmap[index+1] = (uint8_t)(DrawProp.BackColor >> 8);
      } 
    }
  }

  BSP_LCD_DrawBitmap(Xpos, Ypos, bitmap);
}

/**
  * @brief  Sets display window.
  * @param  Xpos: LCD X position
  * @param  Ypos: LCD Y position
  * @param  Width: LCD window width
  * @param  Height: LCD window height  
  * @retval None
  */
static void LCD_SetDisplayWindow(uint16_t Xpos, uint16_t Ypos, uint16_t Width, uint16_t Height)
{
  if(lcd_drv->SetDisplayWindow != NULL)
  {
    lcd_drv->SetDisplayWindow(Xpos, Ypos, Width, Height);
  }  
}

/**
  * @}
  */  
void BSP_LCD_DisplayUint16HexAtLine(uint16_t x_pos ,uint16_t Line,uint16_t digital)
{
  uint8_t str_src[]="0123456789ABCDEF";
  uint8_t str_tar[7];

  uint8_t lo;
  uint8_t hi;
  hi=(uint8_t)(digital>>8);
  lo=(uint8_t)(digital&0x00ff);
  
  str_tar[0]='0';
  str_tar[1]='x';
  str_tar[2]=str_src[hi>>4];
  str_tar[3]=str_src[hi&0x0f];
  str_tar[4]=str_src[lo>>4];
  str_tar[5]=str_src[hi&0x0f];
  
  str_tar[6]='\0';
  
  BSP_LCD_DisplayStringAt(x_pos, LINE(Line),str_tar, LEFT_MODE); 
}

void BSP_LCD_DisplayUint32HexAtLine(uint16_t x_pos ,uint16_t Line,uint32_t digital)
{
  uint8_t b1,b2,b3,b4;
 
  b1=(uint8_t)(digital>>24);
  b2=(uint8_t)(digital>>16);
  b3=(uint8_t)(digital>>8);
  b4=(uint8_t)digital;

  uint8_t str_src[]="0123456789ABCDEF";
  uint8_t str_tar[11];

  str_tar[0]='0';
  str_tar[1]='x';
  str_tar[2]=str_src[b1>>4];
  str_tar[3]=str_src[b1&0x0f];
  str_tar[4]=str_src[b2>>4];
  str_tar[5]=str_src[b2&0x0f];
  str_tar[6]=str_src[b3>>4];
  str_tar[7]=str_src[b3&0x0f];
  str_tar[8]=str_src[b4>>4];
  str_tar[9]=str_src[b4&0x0f];
  
  str_tar[10]='\0';
  
  BSP_LCD_DisplayStringAt(x_pos, LINE(Line),str_tar, LEFT_MODE); 
}
/**
  * @}
  */  
void BSP_LCD_DisplayUint16DecAtLine(uint16_t x_pos ,uint16_t Line,uint16_t digital)
{
  uint8_t str_src[]="0123456789";
  uint8_t str_tar[6];
  uint8_t k1,k2,k3,k4,k5;
  
  k1=digital/10000;
  digital%=10000;
  
  k2=digital/1000;
  digital%=1000;
  
  k3=digital/100;
  digital%=100;
  
  k4=digital/10;
  digital%=10;
  
  k5=digital;

  str_tar[0]=str_src[k1];
  str_tar[1]=str_src[k2];
  str_tar[2]=str_src[k3];
  str_tar[3]=str_src[k4];
  str_tar[4]=str_src[k5];
  
  str_tar[5]='\0';

  BSP_LCD_DisplayStringAt(x_pos, LINE(Line),str_tar, LEFT_MODE); 
}
/**
  * @}
  */  
  
/**
  * @}
  */ 
  
/**
  * @}
  */     

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/

